In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 19, 1, 54, 56, 796000), 7, 'free', None, None, 458, 'Chicago-Naperville-Elgin, IL-IN-WI', '7'),
 (6, datetime.datetime(2018, 11, 19, 2, 1, 33, 796000), 24, 'paid', None, None, 672, 'Lake Havasu City-Kingman, AZ', '24'),
 (7, datetime.datetime(2018, 11, 19, 2, 8, 38, 796000), 24, 'paid', None, None, 672, 'Lake Havasu City-Kingman, AZ', '24'),
 (8, datetime.datetime(2018, 11, 19, 2, 14, 1, 796000), 24, 'paid', None, None, 672, 'Lake Havasu City-Kingman, AZ', '24'),
 (9, datetime.datetime(2018, 11, 19, 2, 17, 48, 796000), 24, 'paid', None, None, 672, 'Lake Havasu City-Kingman, AZ', '24')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(7, 'Adelyn', 'Jordan', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (33, 'Bronson', 'Harris', 'M', 'free'),
 (66, 'Kevin', 'Arellano', 'M', 'free'),
 (25, 'Jayden', 'Graves', 'M', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77506)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', 35.21962, -80.01955)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 19, 1, 54, 56, 796000), 1, 19, 47, 11, 2018, 0),
 (datetime.datetime(2018, 11, 19, 2, 1, 33, 796000), 2, 19, 47, 11, 2018, 0),
 (datetime.datetime(2018, 11, 19, 2, 8, 38, 796000), 2, 19, 47, 11, 2018, 0),
 (datetime.datetime(2018, 11, 19, 2, 14, 1, 796000), 2, 19, 47, 11, 2018, 0),
 (datetime.datetime(2018, 11, 19, 2, 17, 48, 796000), 2, 19, 47, 11, 2018, 0)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).